app/Http/Controllers/SiteController.php

select * from `pages` where `slug` = 'manifest.json' limit 1
---
    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();

select count(*) as aggregate from `payments` where `user_id` = 158 and `payment_status` = 1
---
    public function investLog(Request $request)
    {
        $pageTitle = 'Invest Log';

        $transactions = Payment::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->where('payment_status', 1)->paginate();