app/Http/Controllers/UserController.php

select * from `withdraw_gateways` where `status` = 1 order by `created_at` desc
---
    public function withdraw()
    {
        $pageTitle = 'Withdraw Money';

        $withdraws = WithdrawGateway::where('status', 1)->latest()->get();