app/Http/Controllers/UserController.php

    public function dashboard()
    {

        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->where(
                'next_payment_date',
                '>=',
                now()
            )
            ->latest()
            ->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');
        $currentDayCommision = RefferedCommission::where('reffered_by', Auth::id())->latest()->first('amount');
        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');



        // perfomane chart work
        $LvlOneUsers = Db::table('users')
            ->select('id')
            ->where('reffered_by', Auth::id())
            ->where('status', 1) // Add this line
            ->pluck('id')
            ->toArray();


        $SumLvlOneDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlOneUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlTwoUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlOneUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 158 and `payment_status` = 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 157 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 158 and `payment_status` = 1 and `next_payment_date` >= '2024-08-13 09:41:08' order by `created_at` desc limit 1
select * from `payments` where `user_id` = 158 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (10)
select * from `payments` where `user_id` = 158 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 158
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 158 and `status` = 1
select * from `payments` where `user_id` = 157 order by `created_at` desc limit 10 offset 0
select * from `user_interests` where `user_id` = 157 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 157
select count(*) as aggregate from `user_interests` where `user_id` = 158
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 158
select `amount` from `reffered_commissions` where `reffered_by` = 158 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 157
select sum(`amount`) as aggregate from `payments` where `user_id` = 158 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 158 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 158 and `payment_status` = 1
select `id` from `users` where `reffered_by` = 158 and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (182, 183) and `payment_status` = 1 limit 1
select `id` from `users` where `reffered_by` in (182, 183) and `status` = 1

            ->first();


        $SumLvlOneComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlOneUsers)
            ->first();
        $SumLvlTwoComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlTwoUsers)
            ->first();
---
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (182, 183) limit 1
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (156) limit 1

        // perfomane chart work

        // vip work
        $user = User::find(Auth::id());
        $general = GeneralSetting::first();
---
select * from `users` where `users`.`id` = 158 limit 1
select * from `general_settings` limit 1

                $requiredUsers = $general["req_active_users_vip$i"];

                // Count the actual active users referred by the current user
                $getActiveUsers = User::where('reffered_by', $user->id)
                    ->where('status', 1) // Filter for active users
                    ->count();
---
select count(*) as aggregate from `users` where `reffered_by` = 158 and `status` = 1



        // vip work
        $plans = Plan::where('status', 1)->get();
        $today_deposit_amount = DB::table('deposits')
            ->where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->whereDate('created_at', Carbon::today())
            ->sum('amount');
        $today_withdraw_amount = DB::table('withdraws')
            ->where('user_id', Auth::id())
            ->where('status', 1)
            ->whereDate('created_at', Carbon::today())
            ->sum('withdraw_amount');
            $uplainer_id = DB::table('users')->where('id', auth()->id())->value('reffered_by');
            $uplainer_name = DB::table('users')->where('id', $uplainer_id)->first(['fname', 'lname']);
---
select * from `plans` where `status` = 1
select sum(`amount`) as aggregate from `deposits` where `user_id` = 158 and `payment_status` = 1 and date(`created_at`) = '2024-08-13'
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 158 and `status` = 1 and date(`created_at`) = '2024-08-13'
select `reffered_by` from `users` where `id` = 158 limit 1
select `fname`, `lname` from `users` where `id` = '0' limit 1

    public function commision(Request $request)
    {

        $pageTitle = 'Complete withdraw';

        $commison = RefferedCommission::when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('reffered_by', Auth::id())->latest()->paginate(10, ['*'], 'commison');
---
select count(*) as aggregate from `reffered_commissions` where `reffered_by` = 158